<!DOCTYPE HTML>
<html lang="en" >
    
    <head>
        
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <title>前言 | SpringSecurity 指北手册中文翻译</title>
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="">
        <meta name="generator" content="GitBook 2.5.2">
        
        
        <meta name="HandheldFriendly" content="true"/>
        <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
        <meta name="apple-mobile-web-app-capable" content="yes">
        <meta name="apple-mobile-web-app-status-bar-style" content="black">
        <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
        <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">
        
    <link rel="stylesheet" href="../gitbook/style.css">
    
        
        <link rel="stylesheet" href="../gitbook/plugins/gitbook-plugin-highlight/website.css">
        
    
        
        <link rel="stylesheet" href="../gitbook/plugins/gitbook-plugin-search/search.css">
        
    
        
        <link rel="stylesheet" href="../gitbook/plugins/gitbook-plugin-fontsettings/website.css">
        
    
    

        
    
    
    <link rel="next" href="../getting_started/index.html" />
    
    
    <link rel="prev" href="../index.html" />
    

        
    </head>
    <body>
        
        
    <div class="book" data-level="1" data-chapter-title="前言" data-filepath="preface/README.md" data-basepath=".." data-revision="Tue May 31 2016 22:15:38 GMT+0800 (CST)">
    

<div class="book-summary">
    <nav role="navigation">
        <ul class="summary">
            
            
            
            

            

            
    
        <li class="chapter " data-level="0" data-path="index.html">
            
                
                    <a href="../index.html">
                
                        <i class="fa fa-check"></i>
                        
                        Introduction
                    </a>
            
            
        </li>
    
        <li class="chapter active" data-level="1" data-path="preface/index.html">
            
                
                    <a href="../preface/index.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>1.</b>
                        
                        前言
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="2" data-path="getting_started/index.html">
            
                
                    <a href="../getting_started/index.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.</b>
                        
                        入门
                    </a>
            
            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.1" data-path="getting_started/introduction/index.html">
            
                
                    <a href="../getting_started/introduction/index.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.1.</b>
                        
                        介绍
                    </a>
            
            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.1.1" data-path="getting_started/introduction/what_is_springsecurity.html">
            
                
                    <a href="../getting_started/introduction/what_is_springsecurity.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.1.1.</b>
                        
                        什么是SpringSecurity
                    </a>
            
            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="3" data-path="architecture_implementation/index.html">
            
                
                    <a href="../architecture_implementation/index.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.</b>
                        
                        结构和实现
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="4" data-path="testing/index.html">
            
                
                    <a href="../testing/index.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>4.</b>
                        
                        测试
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="5" data-path="wep_application_security/index.html">
            
                
                    <a href="../wep_application_security/index.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>5.</b>
                        
                        Web应用的安全
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="6" data-path="authorization/index.html">
            
                
                    <a href="../authorization/index.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>6.</b>
                        
                        授权
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="7" data-path="additional_topics/index.html">
            
                
                    <a href="../additional_topics/index.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>7.</b>
                        
                        其他主题
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="8" data-path="spring_data_integration/index.html">
            
                
                    <a href="../spring_data_integration/index.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>8.</b>
                        
                        与SpringData集成
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="9" data-path="appendix/index.html">
            
                
                    <a href="../appendix/index.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>9.</b>
                        
                        附录
                    </a>
            
            
        </li>
    


            
            <li class="divider"></li>
            <li>
                <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
                    Published with GitBook
                </a>
            </li>
            
        </ul>
    </nav>
</div>

    <div class="book-body">
        <div class="body-inner">
            <div class="book-header" role="navigation">
    <!-- Actions Left -->
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../" >SpringSecurity 指北手册中文翻译</a>
    </h1>
</div>

            <div class="page-wrapper" tabindex="-1" role="main">
                <div class="page-inner">
                
                
                    <section class="normal" id="section-">
                    
                        <h1 id="&#x7B2C;&#x4E00;&#x90E8;&#x5206;--&#x524D;&#x8A00;">&#x7B2C;&#x4E00;&#x90E8;&#x5206;.  &#x524D;&#x8A00;</h1>
<hr>
<p>Spring Security provides a comprehensive security solution for Java EE-based enterprise software applications. As you will discover as you venture through this reference guide, we have tried to provide you a useful and highly configurable security system.</p>
<p><em>Spring Security</em>  &#x4E3A;&#x57FA;&#x4E8E;JavaEE&#x7684;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x63D0;&#x4F9B;&#x4E86;&#x5168;&#x9762;&#x7684;&#x5B89;&#x5168;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x901A;&#x8FC7;&#x8FD9;&#x4EFD;&#x6307;&#x5357;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x6211;&#x4EEC;&#x5C1D;&#x8BD5;&#x4E3A;&#x4F60;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x53EF;&#x7528;&#x7684;&#x548C;&#x9AD8;&#x5EA6;&#x53EF;&#x914D;&#x7F6E;&#x7684;&#x5B89;&#x5168;&#x7CFB;&#x7EDF;</p>
<p>Security is an ever-moving target, and it&#x2019;s important to pursue a comprehensive, system-wide approach. In security circles we encourage you to adopt &quot;layers of security&quot;, so that each layer tries to be as secure as possible in its own right, with successive layers providing additional security.</p>
<p>&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#x9700;&#x8981;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x5B89;&#x5168;&#x5404;&#x6709;&#x4E0D;&#x540C;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x662F;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x5168;&#x9762;&#x7CFB;&#x7EDF;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5728;&#x5B89;&#x5168;&#x90BB;&#x57DF;&#xFF0C;&#x6211;&#x4EEC;&#x5F3A;&#x70C8;&#x5EFA;&#x8BAE;&#x4F60;&#x91C7;&#x53D6;&#x201C;layers of security&#x201D;(&#x5B89;&#x5168;&#x5C42;),&#x4F7F;&#x6BCF;&#x4E00;&#x5C42;&#x5728;&#x5B83;&#x81EA;&#x5DF1;&#x7684;&#x6743;&#x9650;&#x8303;&#x56F4;&#x5185;&#x5C3D;&#x53EF;&#x80FD;&#x5B89;&#x5168;&#xFF0C;&#x8FDE;&#x7EED;&#x5C42;&#x63D0;&#x4F9B;&#x989D;&#x5916;&#x7684;&#x5B89;&#x5168;&#x3002;</p>
<p>The &quot;tighter&quot; the security of each layer, the more robust and safe your application will be</p>
<p>&#x5B89;&#x5168;&#x5C42;&#x8D8A;&#x5BC6;&#x96C6;&#xFF0C;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x4E5F;&#x4F1A;&#x66F4;&#x5065;&#x58EE;&#x66F4;&#x5B89;&#x5168;</p>
<p>At the bottom level you&#x2019;ll need to deal with issues such as transport security and system identification, in order to mitigate man-in-the-middle attacks.</p>
<p>&#x5728;&#x6700;&#x5E95;&#x5C42;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x89E3;&#x51B3;&#x8BF8;&#x5982;&#x4F20;&#x8F93;&#x7684;&#x5B89;&#x5168;,&#x7CFB;&#x7EDF;&#x8BC6;&#x522B;&#x7B49;&#x95EE;&#x9898;&#xFF0C;&#x4EE5;&#x51CF;&#x5C11;&#x4E2D;&#x95F4;&#x4EBA;&#x7684;&#x653B;&#x51FB;
&#xFF08;&#x6CE8;:&#x4E2D;&#x95F4;&#x4EBA;<a href="https://zh.wikipedia.org/wiki/%E4%B8%AD%E9%97%B4%E4%BA%BA%E6%94%BB%E5%87%BB" target="_blank">&#x7EF4;&#x57FA;&#x767E;&#x79D1;</a>&#xFF09;</p>
<p> Next you&#x2019;ll generally utilise firewalls, perhaps with VPNs or IP security to ensure only authorised systems can attempt to connect.</p>
<p> &#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x4F60;&#x901A;&#x5E38;&#x4F1A;&#x5229;&#x7528;&#x9632;&#x706B;&#x5899;,&#x4E5F;&#x8BB8;&#x4F7F;&#x7528;VPN&#x6216;ip&#x5B89;&#x5168;&#x786E;&#x4FDD;&#x53EA;&#x6709;&#x88AB;&#x6388;&#x6743;&#x7684;&#x7CFB;&#x7EDF;&#x80FD;&#x591F;&#x94FE;&#x63A5;&#x3002;</p>
<p>  In corporate environments you may deploy a DMZ to separate public-facing servers from backend database and application servers. </p>
<p> &#x5728;&#x4F01;&#x4E1A;&#x73AF;&#x5883;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x90E8;&#x7F72;&#x4E00;&#x4E2A; DMZ&#xFF08;&#x6CE8;:DWZ&#xFF1A;<a href="https://zh.wikipedia.org/wiki/DMZ" target="_blank">&#x7EF4;&#x57FA;&#x767E;&#x79D1;</a>&#xFF09; &#x5C06;&#x9762;&#x5411;&#x7528;&#x6237;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4E0E;&#x540E;&#x53F0;&#x6570;&#x636E;&#x5E93;&#x548C;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x5206;&#x5272;&#x5F00;&#x3002;</p>
<p> Your operating system will also play a critical part, addressing issues such as running processes as non-privileged users and maximising file system security</p>
<p>&#x4F60;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E5F;&#x662F;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x4E2A;&#x73AF;&#x8282;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;&#x8FD0;&#x884C;&#x7684;&#x8FDB;&#x7A0B;&#x5E94;&#x8BE5;&#x4EE5;&#x975E;&#x7279;&#x6743;&#x7528;&#x6237;&#x8FD0;&#x884C;&#xFF0C;&#x5E76;&#x6700;&#x5927;&#x9650;&#x5EA6;&#x5730;&#x63D0;&#x9AD8;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x5B89;&#x5168;&#x6027;&#x95EE;&#x9898;</p>
<p>Hopefully somewhere along the way you&#x2019;ll be trying to prevent denial of service and brute force attacks against the system.</p>
<p>&#x5E0C;&#x671B;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F60;&#x80FD;&#x591F;&#x963B;&#x6B62;&#x4E00;&#x4E9B;&#x975E;&#x6CD5;&#x8BF7;&#x6C42;&#x548C;&#x66B4;&#x529B;&#x653B;&#x51FB;&#x3002;</p>
<p>An intrusion detection system will also be especially useful for monitoring and responding to attacks, with such systems able to take protective action such as blocking offending TCP/IP addresses in real-time</p>
<p>&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x68C0;&#x6D4B;&#x548C;&#x54CD;&#x5E94;&#x653B;&#x51FB;&#x7684;&#x5165;&#x4FB5;&#x68C0;&#x6D4B;&#x7CFB;&#x7EDF;&#x662F;&#x975E;&#x5E38;&#x6709;&#x7528;&#x7684;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;&#x80FD;&#x591F;&#x5B9E;&#x65F6;&#x7684;&#x91C7;&#x53D6;&#x52A8;&#x4F5C;&#x963B;&#x65AD;&#x8BE5;TCP/IP.</p>
<p> Moving to the higher layers, your Java Virtual Machine will hopefully be configured to minimize the permissions granted to different Java types, and then your application will add its own problem domain-specific security configuration.</p>
<p> &#x8BF4;&#x5B8C;&#x6700;&#x5E95;&#x5C42;&#xFF0C;&#x518D;&#x770B;&#x4E0A;&#x5C42;&#xFF0C;Jvm&#x80FD;&#x591F;&#x4E3A;&#x4E0D;&#x540C;&#x7684;java&#x7C7B;&#x578B;&#x6388;&#x4E88;&#x4E0D;&#x540C;&#x6743;&#x9650;&#xFF0C;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x80FD;&#x591F;&#x589E;&#x52A0;&#x5B83;&#x81EA;&#x5DF1;&#x7684;&#x7279;&#x5B9A;&#x9886;&#x57DF;&#x5B89;&#x5168;&#x914D;&#x7F6E;</p>
<p> Spring Security makes this latter area - application security - much easier.</p>
<p> SpringSecurity  &#x4F7F;&#x5F97;&#x540E;&#x4E00;&#x9886;&#x57DF;--&#x5E94;&#x7528;&#x5B89;&#x5168;--&#x66F4;&#x7B80;&#x5355;</p>
<p> Of course, you will need to properly address all security layers mentioned above, together with managerial factors that encompass every layer. A non-exhaustive list of such managerial factors would include security bulletin monitoring, patching, personnel vetting, audits, change control, engineering management systems, data backup, disaster recovery, performance benchmarking, load monitoring, centralised logging, incident response procedures etc</p>
<p> &#x5F53;&#x7136;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x5904;&#x7406;&#x597D;&#x4EE5;&#x4E0A;&#x63D0;&#x5230;&#x7684;&#x6240;&#x6709;&#x5B89;&#x5168;&#x5C42;&#xFF0C;&#x4EE5;&#x53CA;&#x6BCF;&#x4E00;&#x5C42;&#x7684;&#x7BA1;&#x7406;&#x8981;&#x7D20;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x7BA1;&#x7406;&#x56E0;&#x7D20;&#x5927;&#x4F53;&#x5305;&#x62EC;&#x5B89;&#x5168;&#x516C;&#x544A;&#x76D1;&#x6D4B;&#xFF0C;&#x8865;&#x4E01;&#xFF0C;&#x4EBA;&#x4E8B;&#x5BA1;&#x67E5;&#xFF0C;&#x5BA1;&#x8BA1;&#xFF0C;&#x53D8;&#x66F4;&#x63A7;&#x5236;&#xFF0C;&#x5DE5;&#x7A0B;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#xFF0C;&#x6570;&#x636E;&#x5907;&#x4EFD;&#xFF0C;&#x707E;&#x96BE;&#x6062;&#x590D;&#xFF0C;&#x6027;&#x80FD;&#x57FA;&#x51C6;&#x6D4B;&#x8BD5;&#xFF0C;&#x8D1F;&#x8F7D;&#x76D1;&#x63A7;&#xFF0C;&#x96C6;&#x4E2D;&#x5F0F;&#x65E5;&#x5FD7;&#x8BB0;&#x5F55;&#xFF0C;&#x4E8B;&#x4EF6;&#x54CD;&#x5E94;&#x7A0B;&#x5E8F;&#x7B49;</p>
<p> With Spring Security being focused on helping you with the enterprise application security layer, you will find that there are as many different requirements as there are business problem domains. A banking application has different needs from an ecommerce application. An ecommerce application has different needs from a corporate sales force automation tool. These custom requirements make application security interesting, challenging and rewarding.</p>
<p> SpringSecurity &#x65E8;&#x5728;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x5B89;&#x5168;&#x5C42;&#x5BF9;&#x4F60;&#x8FDB;&#x884C;&#x5E2E;&#x52A9;&#xFF0C;&#x56E0;&#x4E3A;&#x6D89;&#x53CA;&#x5230;&#x5546;&#x4E1A;&#x9886;&#x57DF;&#xFF0C;&#x6240;&#x4EE5;&#x6709;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x9700;&#x6C42;&#x3002;&#x6BD4;&#x5982;&#xFF1A;&#x4E00;&#x4E2A;&#x94F6;&#x884C;&#x5E94;&#x7528;&#x4E0E;&#x4E00;&#x4E2A;&#x7535;&#x5546;&#x5E94;&#x7528;&#x5728;&#x9700;&#x6C42;&#x4E0A;&#x7531;&#x5F88;&#x5927;&#x4E0D;&#x540C;&#xFF0C;&#x7535;&#x5546;&#x5E94;&#x7528;&#x548C;&#x4E00;&#x4E2A;&#x4F01;&#x4E1A;&#x81EA;&#x52A8;&#x5316;&#x9500;&#x552E;&#x5DE5;&#x5177;&#x7684;&#x9700;&#x6C42;&#x53C8;&#x6709;&#x5F88;&#x5927;&#x4E0D;&#x540C;&#x3002;&#x8FD9;&#x4E9B;&#x5B9A;&#x5236;&#x5316;&#x9700;&#x6C42;&#x4F7F;&#x5F97;&#x5E94;&#x7528;&#x5B89;&#x5168;&#x6709;&#x8DA3;&#xFF0C;&#x5145;&#x6EE1;&#x6311;&#x6218;&#x6027;&#x800C;&#x4E14;&#x6709;&#x56DE;&#x62A5;&#x3002;</p>
<p> Please read Part II, &#x201C;Getting Started&#x201D;, in its entirety to begin with. This will introduce you to the framework and the namespace-based configuration system with which you can get up and running quite quickly. To get more of an understanding of how Spring Security works, and some of the classes you might need to use, you should then read Part III, &#x201C;Architecture and Implementation&#x201D;. </p>
<p> &#x8BF7;&#x9605;&#x8BFB;<a href="http://wangxj.net/springsecurity-reference-cn/getting_started/index.html" target="_blank">&#x7B2C;&#x4E8C;&#x90E8;&#x5206; &#x5165;&#x95E8;</a>&#x8FD9;&#x662F;&#x6574;&#x4F53;&#x7684;&#x5F00;&#x59CB;&#xFF0C;&#x8FD9;&#x90E8;&#x5206;&#x5411;&#x4F60;&#x4ECB;&#x7ECD;&#x4E86;&#x6846;&#x67B6;&#x548C;&#x57FA;&#x4E8E;&#x547D;&#x540D;&#x7A7A;&#x95F4;&#x7684;&#x914D;&#x7F6E;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F60;&#x914D;&#x7F6E;&#x597D;&#x5E94;&#x7528;&#x5F88;&#x5FEB;&#x7684;&#x8FD0;&#x884C;&#x8D77;&#x6765;&#x3002;&#x60F3;&#x8981;&#x4E86;&#x89E3;springsecurity&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#xFF0C;&#x6216;&#x8005;&#x4F60;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x4E00;&#x4E9B;&#x7C7B;&#x8BF7;&#x9605;&#x8BFB;<a href="http://wangxj.net/springsecurity-reference-cn/architecture_implementation/index.html" target="_blank">&#x7B2C;&#x4E09;&#x90E8;&#x5206;  &#x7ED3;&#x6784;&#x548C;&#x5B9E;&#x73B0;</a></p>
<p> The remaining parts of this guide are structured in a more traditional reference style, designed to be read on an as-required basis. We&#x2019;d also recommend that you read up as much as possible on application security issues in general. Spring Security is not a panacea which will solve all security issues. It is important that the application is designed with security in mind from the start. Attempting to retrofit it is not a good idea. In particular, if you are building a web application, you should be aware of the many potential vulnerabilities such as cross-site scripting, request-forgery and session-hijacking which you should be taking into account from the start. </p>
<p> &#x672C;&#x6307;&#x5357;&#x7684;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x662F;&#x66F4;&#x4F20;&#x7EDF;&#x7684;&#x5F15;&#x7528;&#x6837;&#x5F0F;&#x7ED3;&#x6784;&#xFF0C;&#x8BBE;&#x8BA1;&#x7528;&#x4E8E;&#x6309;&#x9700;&#x8FDB;&#x884C;&#x9605;&#x8BFB;&#x3002;&#x6211;&#x4EEC;&#x5EFA;&#x8BAE;&#x4F60;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x4E86;&#x89E3;&#x4E00;&#x4E9B;&#x666E;&#x904D;&#x5B89;&#x5168;&#x95EE;&#x9898;&#x3002;Spring Security&#x4E0D;&#x662F;&#x4E07;&#x80FD;&#x7684;&#xFF0C;&#x4E0D;&#x80FD;&#x89E3;&#x51B3;&#x6240;&#x6709;&#x5B89;&#x5168;&#x95EE;&#x9898;&#x3002;&#x91CD;&#x8981;&#x7684;&#x662F;&#x5728;&#x5E94;&#x7528;&#x8BBE;&#x8BA1;&#x5F00;&#x59CB;&#x4E4B;&#x521D;&#x5C31;&#x8003;&#x8651;&#x5230;&#x5B89;&#x5168;&#x6027;&#x3002;&#x540E;&#x671F;&#x6539;&#x9020;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x4E3B;&#x610F;&#x3002;&#x7279;&#x522B;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6B63;&#x5728;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;Web&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x77E5;&#x9053;&#x8BB8;&#x591A;&#x6F5C;&#x5728;&#x7684;&#x6F0F;&#x6D1E;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x8DE8;&#x7AD9;&#x811A;&#x672C;&#x3001;&#x8BF7;&#x6C42;&#x4F2A;&#x9020;&#x548C;&#x4F1A;&#x8BDD;&#x52AB;&#x6301;&#x3002;&#x8FD9;&#x4E9B;&#x4F60;&#x5F00;&#x59CB;&#x5C31;&#x5E94;&#x8BE5;&#x8003;&#x8651;&#x3002;</p>
<p> The OWASP web site (<a href="http://www.owasp.org/" target="_blank">http://www.owasp.org/</a>) maintains a top ten list of web application vulnerabilities as well as a lot of useful reference information.</p>
<p> &#x8FD9;&#x4E2A;&#x7F51;&#x7AD9; OWASP &#xFF08;<a href="http://www.owasp.org/" target="_blank">http://www.owasp.org/</a>&#xFF09; &#x7EF4;&#x62A4;&#x4E86;&#x4E00;&#x4E2A;10&#x5927;&#x7F51;&#x7AD9;&#x5E94;&#x7528;&#x6F0F;&#x6D1E;&#x5217;&#x8868;&#x548C;&#x4E00;&#x4E9B;&#x6709;&#x7528;&#x7684;&#x53C2;&#x8003;&#x4FE1;&#x606F;&#x3002;</p>
<p> We hope that you find this reference guide useful, and we welcome your feedback and suggestions.</p>
<p>Finally, welcome to the Spring Security community.</p>
<p>&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x8FD9;&#x4E2A;&#x53C2;&#x8003;&#x624B;&#x518C;&#x5BF9;&#x4F60;&#x6765;&#x8BF4;&#x6BD4;&#x8F83;&#x6709;&#x7528;&#xFF0C;&#x6B22;&#x8FCE;&#x4F60;&#x7684;&#x53CD;&#x9988;&#x548C;&#x5EFA;&#x8BAE;&#x3002;</p>
<p>&#x6700;&#x540E;&#x6B22;&#x8FCE;&#x4F60;&#x6765;&#x5230;<a href="http://docs.spring.io/spring-security/site/docs/current/reference/htmlsingle/#community" target="_blank">Spring Security</a>&#x793E;&#x533A;&#x3002;</p>

                    
                    </section>
                
                
                </div>
            </div>
        </div>

        
        <a href="../index.html" class="navigation navigation-prev " aria-label="Previous page: Introduction"><i class="fa fa-angle-left"></i></a>
        
        
        <a href="../getting_started/index.html" class="navigation navigation-next " aria-label="Next page: 入门"><i class="fa fa-angle-right"></i></a>
        
    </div>
</div>

        
<script src="../gitbook/app.js"></script>

    
    <script src="../gitbook/plugins/gitbook-plugin-search/lunr.min.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-search/search.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-sharing/buttons.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-fontsettings/buttons.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-livereload/plugin.js"></script>
    

<script>
require(["gitbook"], function(gitbook) {
    var config = {"highlight":{},"search":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"livereload":{}};
    gitbook.start(config);
});
</script>

        
    </body>
    
</html>
